src/Documents/СтопЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СтопЛист</Name>
			<Comment>служебный</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>вСтопе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйТовар</Name>
							<Comment>Признак добавления нового товара</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтопЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтопЛист</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>вСтопе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйТовар</Name>
					<Comment>Признак добавления нового товара</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОбработкаСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбработкаСобытий</Name>
			<Comment>для обработки на рабочем месте</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Тип события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Произвольное описание события</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСобытия</Name>
					<Comment>Идентификатор марки или guid элемента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
			<Comment>Типы событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Произвольное текстовое сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтопЛист</Name>
					<Comment>Обработка документа Стоп-лист</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланМеню</Name>
					<Comment>Обработка документа План-Меню</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрактиръМобайлСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрактиръМобайлОтправкаНаПейджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыРМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/СтопЛист/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ДополнительныеСвойства.Свойство("Новый") Тогда
		Возврат;
	КонецЕсли; 
	
	ТекстСообщенияВСтопе = "";
	ТекстСообщенияВПродаже = "";
	
	// запись данных в независимый регистр СтопЛист
	Для каждого СтрокаТовара Из Товары Цикл
		
		РегистрСтопЛист = РегистрыСведений.СтопЛист.СоздатьМенеджерЗаписи();
		РегистрСтопЛист.Период				= Дата;
		РегистрСтопЛист.Товар				= СтрокаТовара.Товар;
		РегистрСтопЛист.ИнформационнаяБаза	= ИнформационнаяБаза;
		РегистрСтопЛист.вСтопе				= СтрокаТовара.вСтопе;
		РегистрСтопЛист.Остаток				= СтрокаТовара.Остаток;
		РегистрСтопЛист.Автор				= Автор;
		РегистрСтопЛист.Заказ				= Заказ;
		РегистрСтопЛист.НовыйТовар			= СтрокаТовара.НовыйТовар;
		РегистрСтопЛист.Записать();
		
		Если СтрокаТовара.вСтопе Тогда
			Если СтрокаТовара.Остаток = 0 Тогда
				ТекстСообщенияВСтопе = ТекстСообщенияВСтопе + СтрокаТовара.Товар.Наименование + Символы.ПС;
			КонецЕсли; 
		Иначе
			ТекстСообщенияВПродаже = ТекстСообщенияВПродаже + СтрокаТовара.Товар.Наименование + Символы.ПС;
		КонецЕсли; 
	КонецЦикла; 
	
	#Если Клиент Тогда
		МассивСотрудников = ИнтерфейсРМ.СоставСмены();
		
	#КонецЕсли
	
	// запись события в регистр ОчередьСобытий для вывода оповещений
	// на всех рабочих местах, кроме текущего
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.РабочиеМеста.Ссылка 
						|ГДЕ НЕ ПометкаУдаления
						|	И МестоРеализации.ИнформационнаяБаза = &ТекущаяИБ
						|	И Ссылка <> &ТекущееРМ
						|	И Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыРМ.АгентПлюс)
						|");
	#Если Клиент Тогда
		Запрос.УстановитьПараметр("ТекущаяИБ", ИнформационнаяБаза);
		Запрос.УстановитьПараметр("ТекущееРМ", глРабочееМесто);
		// для ГлавнаяФорма
		Оповестить("ОбновитьСтопЛист");
	#Иначе
		Запрос.УстановитьПараметр("ТекущееРМ", Неопределено);
	#КонецЕсли						
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработкаСобытийЗапись = РегистрыСведений.ОбработкаСобытий.СоздатьМенеджерЗаписи();
		ОбработкаСобытийЗапись.Период			= '20010101';	// событие не отложенное, но пустую дату записывать нельзя
		ОбработкаСобытийЗапись.РабочееМесто	= Выборка.Ссылка;
		ОбработкаСобытийЗапись.ИдСобытия	= Строка(Ссылка.УникальныйИдентификатор());
		ОбработкаСобытийЗапись.ТипСобытия	= Перечисления.ТипыСобытий.СтопЛист;
		ОбработкаСобытийЗапись.Записать();
	КонецЦикла; 
	
КонецПроцедуры
